<?php
/*
 *
 * // +----------------------------------------------------------------------
 * // | 易东云文档发布应用
 * // +----------------------------------------------------------------------
 * // | 官方网址：https://web.ydc.show
 * // +----------------------------------------------------------------------
 * // | 易东云团队 版权所有 开源版本可自由商用
 * // +----------------------------------------------------------------------
 * // | Author: YiDong Cloud Team
 * // +----------------------------------------------------------------------
 */

return [
    'ERR_VAULT_NAME_DUP'     => '同名仓库已存在',
    'ERR_VAULT_PATH_DUP'     => '仓库下的同名路径已存在',
    'ERR_PATH_DEPTH_LIMIT'   => '目录深度超过限制',
    'ERR_DEL_DOCS_PATH'      => '无法删除docs目录',
    'ERR_DEL_BLOG_PATH'      => '无法删除blog目录',
    'ERR_DEL_PARENT_PATH'    => '无法删除有子目录的目录',
    'ERR_DEL_PATH_WITH_DATA' => '无法删除有文档的目录',
    'ERR_VAULT_NO_FOUND'     => '仓库不存在',
    'ERR_PATH_NO_FOUND'      => '目录不存在',
    'ERR_MD_NO_FOUND'        => '文档不存在',
    'ERR_MD_UUID_EXISTS'     => '同仓库下的路径下的同名文档已经存在，请编辑而不是新建',
    'SUC_PUBLISH'            => '发布成功',
    'ERR_CONFIG_API_ID'      => 'API ID 配置有误',
    'ERR_CONFIG_API_KEY'     => 'API Key 配置有误',
    'ERR_CONFIG_API_SEC'     => 'API Secret 配置有误',
    'ERR_CONFIG_PUB_URL'     => '发布地址 配置有误',
];