<?php
// +----------------------------------------------------------------------
// | Niucloud-admin 企业快速开发的saas管理平台
// +----------------------------------------------------------------------
// | 官方网址：https://www.niucloud-admin.com
// +----------------------------------------------------------------------
// | niucloud团队 版权所有 开源版本可自由商用
// +----------------------------------------------------------------------
// | Author: Niucloud Team
// +----------------------------------------------------------------------
/**
 * 插件api接口语言
 */
return [
    //系统常用
    'TK_DEVTOOL_RETURN' => '开发工具数据返回',
    'TK_DEVTOOL_SUCCESS' => '操作成功',
    'TK_DEVTOOL_ERROR' => '操作成功',
    'DELETE_SUCCESS'=>'删除成功'
];
